In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np

plt.style.use('fivethirtyeight')
sns.set_context("notebook")

In [2]:
import requests
from pathlib import Path

namesbystate_path = Path('namesbystate.zip')
data_url = 'https://www.ssa.gov/oact/babynames/state/namesbystate.zip'

if not namesbystate_path.exists():
    print ('Downloading...', end=' ')
    resp = requests.get(data_url)
    with namesbystate_path.open('wb') as f:
        f.wirte(resp.content)
    print ('Done!')

In [3]:
import zipfile
zf = zipfile.ZipFile(namesbystate_path, 'r')
print ([f.filename for f in zf.filelist])

['DC.TXT', 'DE.TXT', 'FL.TXT', 'GA.TXT', 'HI.TXT', 'IA.TXT', 'ID.TXT', 'IL.TXT', 'IN.TXT', 'KS.TXT', 'KY.TXT', 'LA.TXT', 'MA.TXT', 'MD.TXT', 'ME.TXT', 'MI.TXT', 'MN.TXT', 'MO.TXT', 'MS.TXT', 'MT.TXT', 'NC.TXT', 'ND.TXT', 'NE.TXT', 'NH.TXT', 'NJ.TXT', 'NM.TXT', 'NV.TXT', 'NY.TXT', 'OH.TXT', 'OK.TXT', 'OR.TXT', 'PA.TXT', 'RI.TXT', 'SC.TXT', 'SD.TXT', 'TN.TXT', 'TX.TXT', 'UT.TXT', 'VA.TXT', 'VT.TXT', 'WA.TXT', 'WI.TXT', 'WV.TXT', 'WY.TXT', 'AK.TXT', 'AL.TXT', 'AR.TXT', 'AZ.TXT', 'CA.TXT', 'CO.TXT', 'CT.TXT', 'StateReadMe.pdf']

In [5]:
zf.extract('StateReadMe.pdf')

'/home/kaiser/coueses/DS100Spring18/notes/StateReadMe.pdf'

In [6]:
ca_name = 'CA.TXT'
with zf.open(ca_name) as f:
    for i in range(10):
        print (f.readline().rstrip().decode())

CA,F,1910,Mary,295
CA,F,1910,Helen,239
CA,F,1910,Dorothy,220
CA,F,1910,Margaret,163
CA,F,1910,Frances,134
CA,F,1910,Ruth,128
CA,F,1910,Evelyn,126
CA,F,1910,Alice,118
CA,F,1910,Virginia,101
CA,F,1910,Elizabeth,93

In [7]:
zf.extract(ca_name)
!head {ca_name}

In [8]:
!echo {ca_name}

CA.TXT

In [9]:
import os; os.unlink(ca_name)

In [10]:
import pandas as pd
field_names = ['State', 'Sex', 'Year', 'Name', 'Count']
with zf.open(ca_name) as fh:
    ca = pd.read_csv(fh, header=None, names=field_names)
ca.head()

  State Sex  Year      Name  Count
0    CA   F  1910      Mary    295
1    CA   F  1910     Helen    239
2    CA   F  1910   Dorothy    220
3    CA   F  1910  Margaret    163
4    CA   F  1910   Frances    134

In [11]:
ca['Count'].head()

0    295
1    239
2    220
3    163
4    134
Name: Count, dtype: int64

In [12]:
ca[0:3]

  State Sex  Year     Name  Count
0    CA   F  1910     Mary    295
1    CA   F  1910    Helen    239
2    CA   F  1910  Dorothy    220

In [13]:
ca.iloc[:3, -2:]

      Name  Count
0     Mary    295
1    Helen    239
2  Dorothy    220

In [14]:
ca.loc[0:3, 'State']

0    CA
1    CA
2    CA
3    CA
Name: State, dtype: object

In [15]:
ca['Name'].head()

0        Mary
1       Helen
2     Dorothy
3    Margaret
4     Frances
Name: Name, dtype: object

In [16]:
ca[['Name']].head()

       Name
0      Mary
1     Helen
2   Dorothy
3  Margaret
4   Frances

In [17]:
emails = ca.head()
emails.index = ['a@gmail.com', 'b@gmail.com', 'c@gamail.com', 'd@gmail.com', 'e@gmail.com']
emails

             State Sex  Year      Name  Count
a@gmail.com     CA   F  1910      Mary    295
b@gmail.com     CA   F  1910     Helen    239
c@gamail.com    CA   F  1910   Dorothy    220
d@gmail.com     CA   F  1910  Margaret    163
e@gmail.com     CA   F  1910   Frances    134

In [18]:
emails.loc['b@gmail.com':'d@gmail.com', 'Year':'Name']

              Year      Name
b@gmail.com   1910     Helen
c@gamail.com  1910   Dorothy
d@gmail.com   1910  Margaret

In [19]:
emails.iloc[0:3]

             State Sex  Year     Name  Count
a@gmail.com     CA   F  1910     Mary    295
b@gmail.com     CA   F  1910    Helen    239
c@gamail.com    CA   F  1910  Dorothy    220

In [20]:
ca.head()

  State Sex  Year      Name  Count
0    CA   F  1910      Mary    295
1    CA   F  1910     Helen    239
2    CA   F  1910   Dorothy    220
3    CA   F  1910  Margaret    163
4    CA   F  1910   Frances    134

In [21]:
(ca['Year'] == 2016).head()

0    False
1    False
2    False
3    False
4    False
Name: Year, dtype: bool

In [23]:
ca[ca['Year'] == 2016].tail()

       State Sex  Year     Name  Count
367926    CA   M  2016   Zekiel      5
367927    CA   M  2016    Ziyad      5
367928    CA   M  2016  Zorawar      5
367929    CA   M  2016     Zyan      5
367930    CA   M  2016     Zyir      5

In [24]:
ca_sorted = ca[ca['Year'] == 2016]
ca_sorted.sort_values('Count', ascending=False).tail(10)

       State Sex  Year     Name  Count
217131    CA   F  2016  Maleena      5
217132    CA   F  2016   Maleny      5
217133    CA   F  2016   Maleya      5
217134    CA   F  2016     Mali      5
217135    CA   F  2016   Malika      5
217136    CA   F  2016  Manreet      5
217137    CA   F  2016  Manuela      5
217138    CA   F  2016  Marilee      5
217139    CA   F  2016    Marya      5
367930    CA   M  2016     Zyir      5

In [25]:
ca.head()

  State Sex  Year      Name  Count
0    CA   F  1910      Mary    295
1    CA   F  1910     Helen    239
2    CA   F  1910   Dorothy    220
3    CA   F  1910  Margaret    163
4    CA   F  1910   Frances    134

In [26]:
ca.shape

(367931, 5)

In [28]:
ca.size

1839655

In [29]:
ca.describe()

                Year          Count
count  367931.000000  367931.000000
mean     1982.117169      81.850034
std        25.928678     303.826855
min      1910.000000       5.000000
25%      1966.000000       7.000000
50%      1988.000000      13.000000
75%      2003.000000      39.000000
max      2016.000000    8263.000000

In [31]:
ca.index

RangeIndex(start=0, stop=367931, step=1)

In [32]:
emails

             State Sex  Year      Name  Count
a@gmail.com     CA   F  1910      Mary    295
b@gmail.com     CA   F  1910     Helen    239
c@gamail.com    CA   F  1910   Dorothy    220
d@gmail.com     CA   F  1910  Margaret    163
e@gmail.com     CA   F  1910   Frances    134

In [33]:
emails.index

Index(['a@gmail.com', 'b@gmail.com', 'c@gamail.com', 'd@gmail.com',
       'e@gmail.com'],
      dtype='object')

In [35]:
emails.index.name = 'Email'
emails

             State Sex  Year      Name  Count
Email
a@gmail.com     CA   F  1910      Mary    295
b@gmail.com     CA   F  1910     Helen    239
c@gamail.com    CA   F  1910   Dorothy    220
d@gmail.com     CA   F  1910  Margaret    163
e@gmail.com     CA   F  1910   Frances    134

In [36]:
emails.columns

Index(['State', 'Sex', 'Year', 'Name', 'Count'], dtype='object')

In [37]:
emails.columns.name = 'Fields'
emails

Fields       State Sex  Year      Name  Count
Email
a@gmail.com     CA   F  1910      Mary    295
b@gmail.com     CA   F  1910     Helen    239
c@gamail.com    CA   F  1910   Dorothy    220
d@gmail.com     CA   F  1910  Margaret    163
e@gmail.com     CA   F  1910   Frances    134

In [ ]:
numbers = emails.copy()
numbers.index = []